In [2]:
import pandas as pd
import csv
import numpy as np
import matplotlib.pyplot as plt
from pandas.plotting import table

data = [['foo', 12, 'Calif'], ['foo', 24, 'Calif'], ['bar', 2, 'RhodeIsland'], ['bar', 12, 'RhodeIsland'], ['foo', 11, 'Calif']]
  
# Create the pandas DataFrame
df = pd.DataFrame(data, columns = ['A', 'B', 'C'])
  
# print dataframe.
df

     A   B            C
0  foo  12        Calif
1  foo  24        Calif
2  bar   2  RhodeIsland
3  bar  12  RhodeIsland
4  foo  11        Calif

In [9]:
df2 = df.groupby(['A','C'], as_index=False)['B'].sum()

In [11]:
df2

     A            C   B
0  bar  RhodeIsland  14
1  foo        Calif  47